import DialogLayout from "../../layout";
import { studentCategories } from "../../../Constants/categories";
import HeadingPara, { ParaHeading } from "../../../components/headingPara";

const Topic1 = ({ goback }: { goback: () => void }) => {
  return (
    <DialogLayout heading={studentCategories[0].name} handleClose={goback}>
      <HeadingPara
        heading=""
        para="ڈیڈلائنز اور نصابی کتابوں کے بوجھ تلے دبے ہو؟ پریشان نہ ہوں! یہاں آپ کے لیے نفسیات سے تقویت یافتہ رہنما ہے تاکہ تعلیمیڈڈ تناؤ پر قابو پا سکیں اور آنے والے امتحان میں کامیابی حاصل کر سکیں"
      />
      <HeadingPara
        heading="تقسیم کر دیں"
        para="کام کا بڑا انبار دیکھ کر آپ کا امگدالہ، جو دماغ کا خوف کا مرکز ہے، پریشان ہو جاتا ہے۔ بڑے کاموں کو چھوٹے چھوٹے، قابلِ انتظام حصوں میں تقسیم کر لیں۔ یہ تناؤ کو کم کرتا ہے اور آپ کے کنٹرول کے احساس کو بڑھاتا ہے۔"
      />
      <HeadingPara
        heading="پوموڈورو ٹیکنیک کی طاقت"
        para="وقت کا انتظام ضروری ہے۔ پوموڈورو ٹیکنیک آزمائیں: درمیان میں مختصر وقفوں کے ساتھ، 25 منٹ کے فوکسڈ انٹرولز میں کام کریں۔ یہ آپ کو بہتر کام کرنے کے قابل بناتا ہے اور تھکاوٹ کو روکتا ہے۔"
      />
      <HeadingPara
        heading={
          <ParaHeading
            head={
              <>
                <span>(procrastination) </span>
                ٹال مٹول کے دیو سے دوستی کریں
              </>
            }
          />
        }
        para='اس سے لڑنے کی بجائے اسے قابو میں رکھیں! سوشل میڈیا یا اپنے ڈیسک کو صاف کرنے جیسے کم کوشش والے کاموں کے لیے چھوٹی چھوٹی "ٹال مٹول کی کھڑکیاں" شیڈول کریں۔ یہ کام سے بچنے کی خواہش کو پورا کرتا ہے، جس سے آپ بعد میں پڑھائی پر توجہ مرکوز کر سکتے ہیں۔'
      />
      <HeadingPara
        heading="کامیابی کا تصور کریں"
        para="آنکھیں بند کریں اور خود کو امتحان میں پرسکون انداز سے کامیاب ہوتے ہوئے تصور کریں۔ یہ ذہنی مشق مثبت جذبات اور کارکردگی سے وابستہ دماغی علاقوں کو متحرک کرتی ہے۔"
      />
      <HeadingPara
        heading="پرائمنگ کی طاقت"
        para="اپنے ارد گرد پڑھائی کے لیے مثبت چیزیں رکھیں۔ اپنے مخصوص مطالعے کی جگہ پر کتابیں کھولیں اور سوشل میڈیا جیسی الجھنوں سے دور رہیں۔ یہ آپ کے دماغ کو فوکسڈ سیکھنے کے لیے تیار کرتا ہے (پرائم کرتا ہے"
      />
      <HeadingPara
        heading="انعام کا ردعمل"
        para="ہمارے دماغ انعامات کو پسند کرتے ہیں! اپنے لیے انعام کا نظام بنائیں۔ ایک مطالعے کا سیشن مکمل کرنے کے بعد، اپنے آپ کو کافی بریک یا کسی تفریحی سرگرمی سے نوازیں۔ یہ مثبت مطالعے کی عادات کو مضبوط کرتا ہے۔"
      />
      <HeadingPara
        heading="ساتھی نظام"
        para="اکیلے مشکل ہو سکتا ہے۔ ایک دوسرے سے سوال کرنے، تصورات کی وضاحت کرنے اور کام کا بوجھ بانٹنے کے لیے ایک مطالعہ گروپ بنائیں۔ سماجی تعلق تناؤ کو کم کرتا ہے اور یادداشت کو مضبوط بناتا ہے۔"
      />
      <HeadingPara
        heading="نیند آپ کی سپر پاور ہے"
        para="جب آپ پریشان ہوتے ہیں، تو آرام دہ خوراک کی خواہش کرتے ہیں، نیند کی نہیں۔ لیکن نیند کی کمی یادداشت بنانے کے عمل کو متاثر کرتی ہے۔ بہترین ذہنی صلاحیت کے لیے 7-8 گھنٹے کی باوقت نیند کا ہدف رکھیں۔"
      />
      <HeadingPara
        heading="ورزش سے ملنے والے انڈورفنز"
        para="جسمانی سرگرمی قدرتی طور پر تناؤ کو کم کرنے والی ہوتی ہے۔ تیز چہل قدمی یا جم کا سیشن انڈورفنز جاری کرتا ہے، جس سے موڈ اور ذہنی صلاحیت میں اضافہ ہوتا ہے۔ اس کے علاوہ، ورزش نیند کی کیفیت کو بہتر کر سکتا ہے، جس سے ایک مثبت چکر چلتا ہے۔"
      />
      <HeadingPara
        heading="مثبت خود کلامی"
        para='منفی خود کلامی آپ کی بدترین دشمن ہے۔ "میں یہ نہیں کر سکتا" کو "میں یہ سیکھ سکتا ہوں" سے بدل دیں۔ مثبت خود کی توثیق اعتماد اور حوصلہ بڑھاتی ہے۔'
      />
      <HeadingPara
        heading="مدد حاصل کریں"
        para="مدد مانگنے سے نہ گھبرائیں۔ کسی پروفیسر، کنسلر، یا کسی قابل اعتماد دوست سے بات کریں۔ اپنی مشکلات پر بات کرنا کمزوری نہیں بلکہ طاقت کی نشانی ہے۔"
      />
    </DialogLayout>
  );
};

export default Topic1;
