import DialogLayout from "../../layout";
import { professionalCategories } from "../../../Constants/categories";
import HeadingPara, { ParaHeading } from "../../../components/headingPara";

const Topic2 = ({ goback }: { goback: () => void }) => {
  return (
    <DialogLayout heading={professionalCategories[1].name} handleClose={goback}>
      <HeadingPara
        heading=""
        para="کیا آپ کام کے مطالبات اور ذاتی زندگی کے تقاضوں کے درمیان پھنسے ہوئے محسوس کر رہے ہیں؟ یہاں آپ کے لیے نفسیات پر مبنی ٹولز موجود ہیں تاکہ آپ کام اور زندگی کے توازن کی تنگ رسے پر خوش اسلوبی سے چل سکیں"
      />
      <HeadingPara
        heading="اپنی حدود کو جانیں"
        para="ہم سب میں برداشت کی ایک حد ہوتی ہے۔ اپنی ذاتی تناؤ کی حد کا تعین کریں۔ نئی ذمہ داریاں قبول کرنے سے پہلے، یہ اندازہ لگائیں کہ کیا یہ آپ کو آپ کی حد سے آگے دھکیل دے گا۔"
      />
      <HeadingPara
        heading="ماہر کی طرح الگ الگ کریں"
        para="کام اور ذاتی زندگی کے درمیان ذہنی علیحدگی پیدا کریں۔ مخصوص کام کے اوقات طے کریں اور ان پر قائم رہیں۔ اس وقت کے علاوہ کام کے ای میلز چیک کرنے یا کالز لینے سے گریز کریں۔ یہ ذہنی تبدیلی کام اور زندگی کے درمیان حد ختم ہونے کو کم کرتی ہے۔"
      />
      <HeadingPara
        heading="نہیں کی طاقت"
        para='اضافی کام یا ایسے سماجی وعدوں سے مہذب طریقے سے انکار کرنے سے نہ گھبرائیں جو آپ کی توانائی کو کم کر دیتے ہیں۔ اپنے وقت کی سختی سے حفاظت کریں۔ "نہیں" کہنے سے آپ اپنی توجہ ان چیزوں پر مرکوز کر سکتے ہیں جو واقعی میں اہمیت رکھتی ہیں۔'
      />
      <HeadingPara
        heading="اپنی ذہنی صحت کی حفاظت کے لیے شیڈول بنائیں"
        para='کیلنڈر میں "میرا وقت" یعنئ اپنی ذات کے لیے وقت نکالیں۔ اس وقت کو مقدس سمجھیں - اسے تفریح، ورزش یا صرف آرام کے لیے استعمال کریں۔'
      />
      <HeadingPara
        heading="ویکینڈ پہ توانائی کی بحالی"
        para="ویکینڈ آرام کرنے کے لیے ہوتے ہیں، کام کی تلافی کے لیے نہیں۔ کام کے ای میلز اور نوٹیفکیشنز سے منقطع ہو جائیں۔ ان سرگرمیوں کو ترجیح دیں جو آپ کو آنے والے ہفتے کے لیے توانا کریں۔"
      />
      <HeadingPara
        heading={
          <ParaHeading
            head={
              <>
                <span>(tech) </span>
                یک ڈیٹوکس
              </>
            }
          />
        }
        para="مسلسل ڈیجیٹل رابطہ تناؤ کی ایک خفیف سی کیفیت پیدا کرتا ہے۔ کھانے کے دوران یا سونے سے پہلے ٹیکنالوجی سے پاک زون بنائیں۔ اپنے ذہن کو واقعی آرام کرنے اور توانائی بحال کرنے دیں۔"
      />
      <HeadingPara
        heading="چھوٹے لمحوں کو غنیمت جانیں"
        para="کام اور زندگی کے توازن کے لیے آپ کو بڑے کاموں کی ضرورت نہیں ہے۔ دن بھر میں مختصر ذہنی توجہی وقفے لیں۔ ایک کپ کافی کا مزہ لیں، قدرتی مناظر میں گھومیں، یا صرف چند گہری سانسیں لیں۔"
      />
      <HeadingPara
        heading="اپنے کام کو نئے سرے سے سوچیں"
        para="اپنا نقطہ نظر تبدیل کریں۔ کام کو صرف تناؤ کا ذریعہ نہ سمجھیں بلکہ اسے اپنا حصہ ڈالنے اور کامیابی حاصل کرنے کا طریقہ سمجھیں۔ حوصلہ افزائی اور مجموعی طور پر خوشحالی کو بڑھانے کے لیے اپنی نوکری کے مثبت پہلوؤں پر توجہ دیں۔"
      />
      <HeadingPara
        heading="چھٹیوں کی طاقت"
        para="چھٹیاں لینا کوئی آسائش نہیں بلکہ ایک ضرورت ہے۔ کام سے منقطع کرنے اور توانائی بحال کرنے کے لیے باقاعدگی سے وقفے شیڈول کریں۔ نئے تجربات اور یادیں تھکاوٹ کو دور کرتی ہیں اور تخلیقی صلاحیت کو بڑھاتی ہیں۔"
      />
      <HeadingPara
        heading="اپنے طرح کے لوگ تلاش کریں"
        para="خوشحالی کے لیے سماجی تعلقات ضروری ہیں۔ حوصلہ افزا دوستوں اور خاندان کے ساتھ تعلقات استوار کریں۔ پیاروں کے ساتھ وقت گزارنا تناؤ کے خلاف ایک حفاظت فراہم کرتا ہے اور خوشی کو فروغ دیتا ہے۔"
      />
      <HeadingPara
        heading=""
        para="یاد رکھیں، کام اور زندگی کا توازن ایک منزل نہیں بلکہ ایک سفر ہے۔ ان نکات کو اپناتے ہوئے اور اپنی ذہنی صحت کو ترجیح دیتے ہوئے، آپ کام اور زندگی کے درمیان توازن برقرار رکھنے میں مہارت حاصل کر سکتے ہیں اور وہ زندگی بنا سکتے ہیں جو پرسکون اور لطف اندوز ہو۔"
      />
    </DialogLayout>
  );
};

export default Topic2;
