import DialogLayout from "../../layout";
import { parentingCategories } from "../../../Constants/categories";
import HeadingPara from "../../../components/headingPara";

const Topic1 = ({ goback }: { goback: () => void }) => {
  return (
    <DialogLayout heading={parentingCategories[0].name} handleClose={goback}>
      <HeadingPara
        heading=""
        para={`والدین بننا ایک خوبصورت سفر ہے، لیکن بچے کی ابتدائی زندگی تیز رفتاری سے گزرتی ہے! یہاں آپ کی نفسیاتی رہنمائی کے لیے کچھ نکات دیے گیے ہیں جوآپ کے لیے کارامد ثابت ہوسکتے ہیں۔`}
      />
      <HeadingPara
        heading="رونے کی تفہیم"
        para='یہ صرف ایک بے ترتیب چیخ نہیں ہے! اپنے بچے کے "رونے کے کوڈ" کو سیکھیں۔ بھوک کی وجہ سے آنے والے رونے رِتھمک ہوتے ہیں، جبکہ تکلیف کی وجہ سے آنے والے رونے تیز اور گھبراہٹ والے ہوتے ہیں۔ ان کی ضروریات کو سمجھنا اعتماد پیدا کرتا ہے اور رشتے کو مضبوط بناتا ہے۔'
      />
      <HeadingPara
        heading="آئینہ، آئینہ دیوار پر"
        para="نوزائید بچے نقل کرنے کے لیے تیار ہوتے ہیں۔ اپنے بچے کے چہرے کے تاثرات اور آوازوں کی نقل کریں۔ یہ جذباتی عکاسی (emotional mirroring) جڑنے اور تحفظ کا احساس پیدا کرتی ہے۔"
      />
      <HeadingPara
        heading="جلد سے جلد کا سمفنی"
        para="یہ صرف گلے ملنے سے زیادہ ہے۔ Kangaroo care (جلد سے جلد کا رابطہ) آپ کے بچے بچےکے درجہ حرارت، دل کی دھڑکن اور سانس لینے کو کنٹرول کرتا ہے۔ یہ حیاتیاتی رقص رشتے کو مضبوط کرتا ہے اور صحت مند ترقی کو فروغ دیتا ہے۔"
      />
      <HeadingPara
        heading="کم ہی زیادہ ہے"
        para="نوزائید دماغ آسانی سے بے قابو ہو جاتے ہیں۔ کھیلنے کے دوران توجہ ہٹانے والی چیزوں کو کم سے کم کریں۔ سادہ کھلونوں کا انتخاب کریں جن میں زیادہ تضاد والے رنگ اور نمونے ہوں تاکہ ان کے حواس کو بغیر بوجھ ڈالے انہیں متحرک کیا جا سکے۔"
      />
      <HeadingPara
        heading="روٹین کی طاقت"
        para="سونے، کھانے اور کھیلنے کے لیے متوقع روٹین بنائیں۔ یہ تحفظ کا احساس فراہم کرتا ہے اور آپ کے بچے کو یہ سیکھنے میں مدد کرتا ہے کہ ان کی ضروریات پوری ہوں گی۔ تسلسل اہم ہے"
      />
      <HeadingPara
        heading="بات چیت کریں"
        para="اگرچہ وہ الفاظ نہیں سمجھتے، لیکن اپنے بچے سے بات کریں۔ اپنے دن کا قصہ سنائیں، گانے گائیں، اور اپنے ارد گرد کی چیزوں کا بیان کریں۔ یہ زبان کی نمائش دماغ کی نشوونما کو تیز کرتی ہے اور ابتدائی بات چیت کی صلاحیتوں کو فروغ دیتی ہے۔"
      />
      <HeadingPara
        heading="پیٹ کا وقت"
        para="یہ صرف گردن کی پٹھوں کو مضبوط بنانے کے بارے میں نہیں ہے۔ پیٹ کا وقت آپ کے بچے کی دنیا کو ایک مختلف زاویے سے دریافت کرنے کی اجازت دیتا ہے، جس سے موٹر کی نشوونما اور جگہی شعور کو فروغ ملتا ہے"
      />
      <HeadingPara
        heading="پرسکون کرنے والا ردعمل"
        para={`پیٹ کا درد بہت پریشان کن ہو سکتا ہے۔ آزمائیں  "5 S's" (پانچ آسان طریقے) swaddling (لپٹنا)، shushing (گھٹانا)، swinging (جھولنا)، side/stomach positioning (پلو/پیٹ کی پوزیشن)، اور sucking (چوسنا)۔ یہ طریقے پرسکون کرنے والے رفلیکس کو متحرک کرتے ہیں اور آپ کے پریشان کن بچے کو پرسکون کرتے ہیں۔`}
      />
      <HeadingPara
        heading="جواب دیں، خراب نہ کریں"
        para="جبکہ جوابدہی اعتماد پیدا کرتی ہے، مسلسل توجہ سے گریز کریں۔ اپنے بچے کو مداخلت کرنے سے پہلے تھوڑی دیر تک ہلنے دیں۔ یہ انہیں خود کو پرسکون کرنے کی صلاحیت سکھاتا ہے اور انہیں اپنے جذبات کو کنٹرول کرنے میں مدد کرتا ہے۔"
      />
      <HeadingPara
        heading="ہر قدم (چاہے بڑے ہوں یا چھوٹے) کا جشن منائیں"
        para="ہر گھٹ گھٹانا، غڑانا اور قہقہہ ایک فتح ہے! اپنے بچے کی کامیابیوں کو تسلیم کریں، چاہے وہ کتنی ہی چھوٹی کیوں نہ ہوں۔ یہ مثبت مضبوطی انہیں مزید سیکھنے اور دریافت کرنے کی ترغیب دیتی ہے۔"
      />
      <HeadingPara
        heading="آپ بھی اہم ہیں"
        para="اپنا خیال رکھیں۔ خوش والدین کا مطلب ہے خوش بچہ۔ مدد مانگنے اور اپنی ذہنی و جذباتی صحت کو ترجیح دینے سے نہ گھبرائیں۔ آپ کی ذہنی اور جذباتی حالت براہ راست آپ کے بچے کو متاثر کرتی ہے۔"
      />
      <HeadingPara
        heading=""
        para="یاد رکھیں، والدین بننا سیکھنے اور دریافت کرنے کا سفر ہے۔ ان نکات کو اپناتے ہوئے اور اپنے بچے کی نفسیاتی ضروریات کو سمجھ کر، آپ ایک محبت کرنے والے اور پرورش دینے والے رشتے کی مضبوط بنیاد رکھ سکتے ہیں۔"
      />
    </DialogLayout>
  );
};

export default Topic1;
