import DialogLayout from "../../layout";
import { parentingCategories } from "../../../Constants/categories";
import HeadingPara from "../../../components/headingPara";
import Bullets from "../../../components/bullets";

const Topic3 = ({ goback }: { goback: () => void }) => {
  return (
    <DialogLayout heading={parentingCategories[2].name} handleClose={goback}>
      <HeadingPara
        heading="رونے کی تفہیم"
        para='یہ صرف ایک بے ترتیب چیخ نہیں ہے! اپنے بچے کے "رونے کے کوڈ" کو سیکھیں۔ بھوک کی وجہ سے آنے والے رونے رِتھمک ہوتے ہیں، جبکہ تکلیف کی وجہ سے آنے والے رونے تیز اور گھبراہٹ والے ہوتے ہیں۔ ان کی ضروریات کو سمجھنا اعتماد پیدا کرتا ہے اور رشتے کو مضبوط بناتا ہے۔'
      />
      <HeadingPara
        heading="رونے کی تفہیم"
        para='یہ صرف ایک بے ترتیب چیخ نہیں ہے! اپنے بچے کے "رونے کے کوڈ" کو سیکھیں۔ بھوک کی وجہ سے آنے والے رونے رِتھمک ہوتے ہیں، جبکہ تکلیف کی وجہ سے آنے والے رونے تیز اور گھبراہٹ والے ہوتے ہیں۔ ان کی ضروریات کو سمجھنا اعتماد پیدا کرتا ہے اور رشتے کو مضبوط بناتا ہے۔'
      />
      <HeadingPara
        heading="رونے کی تفہیم"
        para='یہ صرف ایک بے ترتیب چیخ نہیں ہے! اپنے بچے کے "رونے کے کوڈ" کو سیکھیں۔ بھوک کی وجہ سے آنے والے رونے رِتھمک ہوتے ہیں، جبکہ تکلیف کی وجہ سے آنے والے رونے تیز اور گھبراہٹ والے ہوتے ہیں۔ ان کی ضروریات کو سمجھنا اعتماد پیدا کرتا ہے اور رشتے کو مضبوط بناتا ہے۔'
      />
      <HeadingPara
        heading="رونے کی تفہیم"
        para='یہ صرف ایک بے ترتیب چیخ نہیں ہے! اپنے بچے کے "رونے کے کوڈ" کو سیکھیں۔ بھوک کی وجہ سے آنے والے رونے رِتھمک ہوتے ہیں، جبکہ تکلیف کی وجہ سے آنے والے رونے تیز اور گھبراہٹ والے ہوتے ہیں۔ ان کی ضروریات کو سمجھنا اعتماد پیدا کرتا ہے اور رشتے کو مضبوط بناتا ہے۔'
      />
      <HeadingPara
        heading="رونے کی تفہیم"
        para='یہ صرف ایک بے ترتیب چیخ نہیں ہے! اپنے بچے کے "رونے کے کوڈ" کو سیکھیں۔ بھوک کی وجہ سے آنے والے رونے رِتھمک ہوتے ہیں، جبکہ تکلیف کی وجہ سے آنے والے رونے تیز اور گھبراہٹ والے ہوتے ہیں۔ ان کی ضروریات کو سمجھنا اعتماد پیدا کرتا ہے اور رشتے کو مضبوط بناتا ہے۔'
      />
      <Bullets
        bullets={[
          {
            head: " محبت کی",
            text: 'ہر شخص محبت کا اظہار اور اسے قبول کرنے کا اپنا طریقہ رکھتا ہے۔ اپنے ساتھی کی "زبان" دریافت کریں (کام کر کے دکھانا، تعریف کے الفاظ، تحائف، وقت گزارنا، جسمانی لمس) اور اس کے مطابق اپنے اعمال کو ڈھالیں۔',
          },
          {
            head: " محبت کی",
            text: 'ہر شخص محبت کا اظہار اور اسے قبول کرنے کا اپنا طریقہ رکھتا ہے۔ اپنے ساتھی کی "زبان" دریافت کریں (کام کر کے دکھانا، تعریف کے الفاظ، تحائف، وقت گزارنا، جسمانی لمس) اور اس کے مطابق اپنے اعمال کو ڈھالیں۔',
          },
        ]}
      />
    </DialogLayout>
  );
};

export default Topic3;
